# Задача №18: Реализовать алгоритм перемешивания списка.

a = [1, 3, 8]
print (a)

a.append(4)
print (a)