# Создать информационную систему позволяющую работать 
# с сотрудниками некой компании \ студентами вуза \ учениками школы
"""
Должно быть:
Стундент: ФИО, список отменток, по какому предмету д/з 
Предпод: список студентов по группам, добавление д/з
"""
# Какие функции будут использоваться
"""
Функции:
1. Меню
2. База пользователей ('login; password; surname; name; status; description')
3. База предметов("subject_name; login; home_task")
4. Таблицы со студентами
5. Интерфейс студента
6. Интерфейс препода

Интерфейс студента: на вход логин
9. Выйти
1. Спросить предмет -> Выдать дз

Интерфейс преподавателя: на вход логин
9. Выйти
1. Спросить группу
2. Спросить предмет
3. Добавить\изменить дз

Меню:
1. Авторизация(data_read) -> Студент\Преподаватль -> Открыть соответсвующий интерфейс -> "Пользователь не найден"

Методы:
UI
data input
data read
data write
"""